app/controllers/index/index_controller.rb

    def index
      @sliders = Slider.by_status.by_society_id(session["index_society"]["id"]).by_sort
      @articles = Article.by_status.by_society_id(session["index_society"]["id"]).by_create_time.limit(6)
      @activities = Activity.by_status.by_society_id(session["index_society"]["id"]).by_create_time.limit(6)
      @attachments = Attachment.by_status.by_society_id(session["index_society"]["id"]).by_create_time.limit(6)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`status` = 1 AND (society_id = 1) ORDER BY create_time desc LIMIT 6
SELECT `sliders`.* FROM `sliders` WHERE `sliders`.`status` = 1 AND (society_id = 1) ORDER BY `sliders`.`sort` ASC
SELECT  `activities`.* FROM `activities` WHERE `activities`.`status` = 1 AND (society_id = 1) ORDER BY create_time desc LIMIT 6
SELECT  `attachments`.* FROM `attachments` WHERE `attachments`.`status` = 1 AND (society_id = 1) ORDER BY create_time desc LIMIT 6

    def article_detail
      @article =  Article.by_status.by_society_id(session["index_society"]["id"]).find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`status` = 1 AND (society_id = 1) AND `articles`.`id` = 2 LIMIT 1

    def activity
      @activities = Activity
                        .by_status
                        .by_society_id(session["index_society"]["id"])
                        .by_create_time
                        .paginate(page: params['page'] || 1, per_page: params['per_page'] || 10)
      @introduce = Introduce.find_society_introduce(session["index_society"]["id"]).first
---
SELECT  `introduces`.* FROM `introduces` WHERE (society_id = 1 and status = 1) ORDER BY `introduces`.`id` ASC LIMIT 1

    def activity_detail
      @activity =  Activity.by_status.by_society_id(session["index_society"]["id"]).find(params[:id])
---
SELECT  `activities`.* FROM `activities` WHERE `activities`.`status` = 1 AND (society_id = 0) AND `activities`.`id` = 4 LIMIT 1

    def society
      @societies = StuSociety
                      .by_status
                      .paginate(page: params['page'] || 1, per_page: params['per_page'] || 10)
      @introduce = Introduce.find_society_introduce(session["index_society"]["id"]).first
---
SELECT  `introduces`.* FROM `introduces` WHERE (society_id = 1 and status = 1) ORDER BY `introduces`.`id` ASC LIMIT 1
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`status` = 1 AND `stu_societies`.`id` = 0 LIMIT 10 OFFSET 0

    def society_detail

      @introduce = Introduce.find_society_introduce(session["index_society"]["id"]).first
---
SELECT  `introduces`.* FROM `introduces` WHERE (society_id = 1 and status = 1) ORDER BY `introduces`.`id` ASC LIMIT 1

    def join_society
      student = session["user"]
      if !student
        render json: {code: 201, errors: '请先登陆'}
        return
      end
      student_no = session["user"]["student_no"]
      if !student_no
        render json: {code: 201, errors: '请先登陆'}
      else
        society_id = session["index_society"]["id"]
        data = set_data
        res = Level.create(data)
---
INSERT INTO `levels` (`society_id`, `student_no`, `name`, `start_time`, `end_time`, `academy_id`, `major_id`, `location`, `native_place`, `emer_name`, `emer_phone`, `status`, `create_time`, `update_time`) VALUES (1, '201430350301', '陈光炜1', '2021-11-26 00:50:26', '2021-11-26 00:50:26', 0, 0, ' ', ' ', ' ', ' ', 3, '2021-11-26 00:50:26', '2021-11-26 00:50:26')

    def join_activity
      student = session["user"]
      if !student
        render json: {code: 201, errors: '请先登陆'}
        return
      end
      student_no = session["user"]["student_no"]
      if !student_no
        render json: {code: 201, errors: '请先登陆'}
      else
        #society_id = session["index_society"]["id"]
        data1 = set_data1
        res = Con.create(data1)
---
INSERT INTO `cons` (`activity_id`, `society_id`, `student_no`, `name`, `start_time`, `status`, `create_time`) VALUES (NULL, 1, '201430350301', '施哲宇', '2021-11-25 17:58:04', 3, '2021-11-25 17:58:04')

    def change
      society_id = params[:id]
      session[:index_society] = StuSociety.by_status.find(society_id)
---
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`status` = 1 AND `stu_societies`.`id` = 1 LIMIT 1