app/controllers/admin/academies_controller.rb

SELECT `academies`.* FROM `academies` WHERE `academies`.`status` = 1 ORDER BY sort
SELECT `majors`.* FROM `majors` WHERE `majors`.`academy_id` = 1
---
    def get_academy_with_majors
      academy_list = Academy.by_status.order("sort")
      academy_data = academy_list.map{|n| { id: n.id, name: n.name } }
      major_data = []
      academy_list.each_with_index do |item, i|
        major_data[i] = Major.where(academy_id: item.id).map {|n| { academy_id: item.id, id: n.id, name: n.name } }