app/controllers/admin/activities_controller.rb

    def create
      data = set_data
      data[:create_by] = session["user"]["name"]
      data[:create_time] = Time.now.inspect
      res = Activity.create(data)
---
INSERT INTO `activities` (`society_id`, `name`, `apply_end_time`, `apply_start_time`, `content`, `create_by`, `create_time`) VALUES (2, '果壳电影观看', '2022-01-18 00:00:00', '2022-01-14 00:00:00', '<p>果壳电影观看</p><p>果壳电影观看</p><p>果壳电影观看</p><p>果壳电影观看</p><p>果壳电影观看</p>', 'test1', '2022-01-14 09:30:14')

    def set_activity
      @activity = Activity.by_society_id(session['society_id']).find(params[:id])
---
SELECT  `activities`.* FROM `activities` WHERE (society_id = 1) AND `activities`.`id` = 2 LIMIT 1
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1