app/controllers/admin/articles_controller.rb

INSERT INTO `articles` (`title`, `abstract`, `content`, `create_time`, `create_by`, `edit_time`, `edit_by`, `society_id`, `status`) VALUES ('1111111', '11', '<p>撒旦萨的思索<br></p>', '2022-01-22 14:46:21', '程哥哥', '2022-01-22 14:46:21', '程哥哥', 2, 1)
---
    def create
      data = set_data
      data[:create_by] = session["user"]["name"]
      data[:create_time] = Time.now.inspect
      res = Article.create(data)

SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1
---
    def set_article
      @article = Article.by_society_id(session['society_id']).find(params[:id])