app/controllers/admin/attachments_controller.rb

INSERT INTO `attachments` (`name`, `filesize`, `random_name`, `society_id`, `create_by`, `create_time`) VALUES ('f97a2f3ef0320b4c2a500645ec9d78d8.png', '17854', 'f97a2f3ef0320b4c2a500645ec9d78d8.png', 2, '程哥哥', '2022-01-22 14:47:11')
---
    def create
      data = set_data
      data[:create_by] = session["user"]["name"]
      data[:create_time] = Time.now.inspect
      data[:status] = 1
      my_file = MyuploaderUploader.new
      my_file.store_dir = 'uploads/attachments'
      my_file.store!(params[:file])
      data[:random_name] = my_file.filename
      res = Attachment.create(data)

SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1
---
    def set_attachment
      @attachment = Attachment.by_society_id(session['society_id']).find(params[:id])