app/controllers/admin/departments_controller.rb

    def get_department_with_jobs
      department_list = Department.by_society_id(session['society_id']).by_status.order("sort")
---
SELECT `departments`.* FROM `departments` WHERE (society_id = 1) AND `departments`.`status` = 1 ORDER BY sort

    def set_department
      @department = Department.by_society_id(session['society_id']).find(params[:id])
---
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1