app/controllers/admin/introduces_controller.rb

    def update
      data = set_data
      if @introduce.update(data)
---
UPDATE `introduces` SET `content` = '<div>简介</div><div><a href=\"http://localhost:3000/index/society/2\">国科大科研社团</a>的简介</div><p><br></p><p><br></p><p><br></p><p><br></p>' WHERE `introduces`.`id` = 3

    def set_introduce
      @introduce = Introduce.find_society_introduce(session["society_id"]).first
---
SELECT  `introduces`.* FROM `introduces` WHERE (society_id = 2 and status = 1) ORDER BY `introduces`.`id` ASC LIMIT 1