app/controllers/admin/levels_controller.rb

SELECT  `levels`.* FROM `levels` WHERE (society_id = 1) LIMIT 10 OFFSET 0
---
    def index
      @levels = Level.by_name_student_no_search(params['search_key'])
                    .by_society_id(session['society_id'])
                    .paginate(page: params['page'] || 1, per_page: params['per_page'] || 10)

UPDATE `levels` SET `start_time` = '2022-01-21 00:00:00', `end_time` = '2022-01-21 00:00:00', `sex` = 1, `status` = 1, `create_time` = '2022-01-21 17:48:12', `update_time` = '2022-01-21 17:48:12' WHERE `levels`.`id` = 11
---
    def update
      data = set_data
      data.delete('student_no')
      data.delete('create_time')
      if @level.update(data)

SELECT  `levels`.* FROM `levels` WHERE (society_id = 2) AND `levels`.`id` = 11 LIMIT 1
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1
---
    def set_level
      @level = Level.by_society_id(session['society_id']).find(params[:id])