app/controllers/admin/my_controller.rb

    def update
      data = set_data
      if @user.update(data)
---
UPDATE `users` SET `academy_id` = 1, `major_id` = 36, `mail` = '152444985@qq.com', `location` = '张家界水文站', `native_place` = '湖南张家界', `update_time` = '2022-01-21 17:58:19' WHERE `users`.`id` = 10

    def society_change
      society_id = params[:id].to_i
      user_society_ids = Staff.find_user_society_ids(session['user']['id'])
---
SELECT `staffs`.`society_id` FROM `staffs` WHERE (user_id = 1 and status = 1) GROUP BY `staffs`.`society_id`

    def level
      @levels = Level.by_name_student_no_search(params['search_key'])
                    .by_society_id(session['society_id'])
                    .paginate(page: params['page'] || 1, per_page: params['per_page'] || 10)
---
SELECT  `levels`.* FROM `levels` WHERE (society_id = 1) LIMIT 10 OFFSET 0

    def get_academy_with_majors
      academy_list = Academy.by_status.order("sort")
      academy_data = academy_list.map{|n| { id: n.id, name: n.name } }
      major_data = []
      academy_list.each_with_index do |item, i|
        major_data[i] = Major.where(academy_id: item.id).map {|n| { academy_id: item.id, id: n.id, name: n.name } }
---
SELECT `academies`.* FROM `academies` WHERE `academies`.`status` = 1 ORDER BY sort
SELECT `majors`.* FROM `majors` WHERE `majors`.`academy_id` = 1

    def set_user
      @user = User.find(session['user']['id'])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1