app/controllers/admin/sessions_controller.rb

    def create
      user = User.new
      res = user.check_login(params['student_no'], params['password'], params['code'])
      if res['code'] == 200
        puts "---------------------"
        puts "debug!! " + params['student_no'].to_s
        puts "---------------------"
        user_society_ids = Staff.find_user_society_ids(res['user'].id)
---
SELECT `staffs`.`society_id` FROM `staffs` WHERE (user_id = 1 and status = 1) GROUP BY `staffs`.`society_id`