app/controllers/admin/sliders_controller.rb

    def update
      data = set_data
      if @slider.update(data)
---
UPDATE `sliders` SET `random_name` = '3c2e21673f2584d7120aa57b1c9d0972.jpg', `href` = 'https://welcome.ucas.edu.cn/index.php/zh-cn/', `status` = 1 WHERE `sliders`.`id` = 6

    def create
      data = set_data
      data[:create_by] = session["user"]["name"]
      data[:create_time] = Time.now.inspect
      res = Slider.create(data)
---
INSERT INTO `sliders` (`society_id`, `href`, `random_name`, `create_by`, `create_time`, `sort`) VALUES (2, 'https://foreign.ucas.ac.cn/index.php/zh-cn/', '8c7a0b2de3e77c825a8b551c0f79b151.jpg', '陈光炜1', '2022-01-01 23:01:46', 2)

    def destroy
      if @slider.destroy
---
DELETE FROM `sliders` WHERE `sliders`.`id` = 6

    def set_slider
      @slider = Slider.by_society_id(session['society_id']).find(params[:id])
---
SELECT  `sliders`.* FROM `sliders` WHERE (society_id = 2) AND `sliders`.`id` = 6 LIMIT 1
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1