app/controllers/admin/societies_controller.rb

SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 11 LIMIT 1
---
    def set_society
      @society = StuSociety.find(params[:id])