app/controllers/admin/staffs_controller.rb

    def index
      @staffs = Staff.by_name_phone_search(params['search_key'])
                    .by_society_id(session['society_id'])
                    .paginate(page: params['page'] || 1, per_page: params['per_page'] || 10)
---
SELECT  `staffs`.* FROM `staffs` WHERE (society_id = 1) LIMIT 10 OFFSET 0

    def update
      data = set_data
      data.delete('create_time')
      user = User.by_status.where(id: data[:user_id]).first
      unless user.blank?
        data[:student_no] = user[:student_no]
        data[:name] = user[:name]
        if @staff.update(data)
---
SELECT  `users`.* FROM `users` WHERE `users`.`status` = 1 AND `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `staffs` SET `society_admin` = 1, `create_time` = '2022-01-22 14:45:13', `name` = 'test2' WHERE `staffs`.`id` = 6

    def create
      data = set_data
      user = User.by_status.where(id: data[:user_id]).first
      unless user.blank?
        data[:student_no] = user[:student_no]
        data[:name] = user[:name]
        res = Staff.create(data)
---
SELECT  `users`.* FROM `users` WHERE `users`.`status` = 1 AND `users`.`id` = 9 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `staffs` (`name`, `student_no`, `user_id`, `society_id`, `department_id`, `job_id`, `start_time`, `end_time`, `create_time`, `status`) VALUES ('施哲宇', '202128015329003', 9, 1, 2, 47, '2021-11-02 00:00:00', '2021-11-30 00:00:00', '2021-11-05 22:40:14', 1)

    def set_staff
      @staff = Staff.by_society_id(session['society_id']).find(params[:id])
---
SELECT  `staffs`.* FROM `staffs` WHERE (society_id = 2) AND `staffs`.`id` = 6 LIMIT 1
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1