app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` WHERE ((name like '%2017%' or student_no like '%2017%')) LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`
---
    def index
      @users = User.by_name_student_no_search(params['search_key'])
                    .paginate(page: params['page'] || 1, per_page: params['per_page'] || 10)

UPDATE `users` SET `name` = 'test1', `sex` = 1, `academy_id` = 0, `create_time` = '2022-01-02 18:23:52', `update_time` = '2022-01-02 18:23:52' WHERE `users`.`id` = 1
---
    def update
      data = set_data
      data.delete('student_no')
      data.delete('create_time')
      if @user.update(data)

INSERT INTO `users` (`student_no`, `password`, `name`, `create_time`, `update_time`) VALUES ('202128015329', '7c4a8d09ca3762af61e59520943dc26494f8941b', '施哲宇', '2021-11-05 14:38:42', '2021-11-05 14:38:42')
---
    def create
      data = set_data
      data[:password] = Digest::SHA1.hexdigest('123456')
      res = User.create(data)