app/controllers/admin/votes_controller.rb

    def set_vote
      @vote = Vote.by_society_id(session['society_id']).find(params[:id])
---
SELECT  `stu_societies`.* FROM `stu_societies` WHERE `stu_societies`.`id` = 2 LIMIT 1
SELECT  `votes`.* FROM `votes` WHERE (society_id = 2) AND `votes`.`id` = 4 LIMIT 1