app/views/admin/votes/show.html.erb

                  <% get_data_by_pid('vote_id',@vote.id,VoteOption).each do |e| %>
                    <li>(已投<%= get_data_by_pid('vote_option_id',e.id,VoteRecord).length %>票)<input type="checkbox" name="vote_options" value="<%= e.id %>"> <%= e.name %></li>
---
SELECT `vote_options`.* FROM `vote_options` WHERE `vote_options`.`vote_id` = 4