app/controllers/users_controller.rb

  def create
    #取出哈希param中的name、email等元素
    name = params[:name]
    student_no = params[:student_no]
    password = params[:password]
    password_confirmation = params[:password_confirmation]
    sex = params[:sex]
    phone = params[:phone]
    #从账户表中查找是否有相同的email，有相同的email说明该邮箱已经被注册过了
    user = User.find_by(student_no:student_no)
---
SELECT  `users`.* FROM `users` WHERE `users`.`student_no` = '123' ORDER BY `users`.`id` ASC LIMIT 1

        create_time: Time.now.inspect,
        update_time: Time.now.inspect
    }
      res =  User.create(data)
---
INSERT INTO `users` (`student_no`, `password`, `name`, `sex`, `phone`, `create_time`, `update_time`) VALUES ('2017402522', '7c4a8d09ca3762af61e59520943dc26494f8941b', '廖晶', 2, '13974450407', '2022-01-21 17:43:42', '2022-01-21 17:43:42')