app/controllers/users_controller.rb

INSERT INTO `users` (`create_time`, `update_time`) VALUES ('2021-11-05 15:55:34', '2021-11-05 15:55:34')
---
  def  create
      data = set_data
      data[:password] = Digest::SHA1.hexdigest(data[:password])
      res = User.create(data)